cases/openfoam.com/arbitraryRotatingInletACMI/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Generate faceZones for the createBaffles step
    //  a) Generate a faceSet from a patch
    //  b) Generate a faceZoneSet from the faceSet
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // a) Create faceSet using patch interfaceInner
    {
        name    interfaceInnerFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch    interfaceInner;
        }
    }
    // b) Create faceZoneSet using face set
    {
        name    interfaceInnerFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet interfaceInnerFaceSet;
        }
    }

    // a) Create faceSet using patch interfaceOuter
    {
        name    interfaceOuterFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch    interfaceOuter;
        }
    }
    // b) Create faceZoneSet using face set
    {
        name    interfaceOuterFaceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet interfaceOuterFaceSet;
        }
    }

    // Create cellZone for moving cells 
    {
        name    movingCellSet;
        type    cellSet;
        action  new;
        source  cylinderToCell;

        sourceInfo
        {
            p1 (0 0 0.1);
            p2 (0 0 0.2);
            radius 0.05;
        }
    }
    {
        name    movingZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     movingCellSet;
        }
    }
);

// ************************************************************************* //
